{
  "_name_or_path": "bert-base-multilingual-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-AMOUNT",
    "1": "B-CLIENT",
    "2": "B-CURRENCY",
    "3": "B-DATE",
    "4": "B-DOCUMENT_NUMBER",
    "5": "B-DOCUMENT_TYPE",
    "6": "B-END_DATE",
    "7": "I-AMOUNT",
    "8": "I-DATE",
    "9": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-AMOUNT": 0,
    "B-CLIENT": 1,
    "B-CURRENCY": 2,
    "B-DATE": 3,
    "B-DOCUMENT_NUMBER": 4,
    "B-DOCUMENT_TYPE": 5,
    "B-END_DATE": 6,
    "I-AMOUNT": 7,
    "I-DATE": 8,
    "O": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
